// Задача на поиск функции x=f(a)
Console.Write("Введите число => ");
string inputNumber = Console.ReadLine();
int number = int.Parse(inputNumber);

int x = number +11;
Console.WriteLine($"Функция х = f(a): {x}");
